# Итоговая контрольная работа по основному блоку

## Задача:
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

***Примеры***:

*[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []*


## *Решение*

При составлении алгоритма и блок-схемы для решения поставленной задачи я стремился достичь наиболее компактного, "изящного" решения, то есть разделить на методы для их последовательного выполения.

####  Методы (функции) представленные в коде:

- void displayArr(string[] arr) -
Метод позволяющий выводить на экран пользователю все элементы массива строк. Сам по себе ничего не возвращает, в качестве аргумента принимает обозначение массива, который необходимо отобразить.

- void fillArr (string[] arr) - метод, осуществяющий наполение исходного массива строк string[] arrOld, который изначально в коде объявляется, но все его элементы-строки остаются пустыми. Заполнение массива происходит пользователем в ручную с клавиатуры любыми значениями, соответсвующие типу данных string.
Метод принимает в качестве аргумента обозначение исходного массива, производя над ним действие, но ничего не возвращая (void).

- string[] arrNew (string[] arrOld) - метод, который получает в качестве аргумента исходный массив string[] arrOld, проверяет каждый его элемент-строку на соответствие условию задачи, и на основе результата этой проверки создаёт новый массив строк string[] newArr, который сразу же, в рамках этого метода, заполняется подходящими элементами и возращается функцией.

 ##### Краткое описание решения

В самом начале прводится проверка на выбранную пользователем длинну массива-строк.
После этого инициализуется исходный массив.

*Console.Write("Input the number L(Array Lenght): ");*

*int L = int.Parse(Console.ReadLine()!);*

*while (L < 1)*

{

    Console.Write("Error! Wrong Input! Input L again: ");
    L = int.Parse(Console.ReadLine()!);

}

string[] arrOld = new string[L];

Далее выполнение программы сводится к последовательной реализации ранее указанных функций/методов:

fillArr(arrOld); - заполнили исходный массив
displayArr(arrOld); - отобразили исходный массив на экран 
Console.WriteLine("Result: "); - надпись для наглядности 
displayArr(arrNew(arrOld)); - аргумент функции запускает выполение функции образования нового массива строк, которая в свою очередь принимает в качестве аргумента исходный массив, и в итоге возвращает искомый по условию задачи новый массив-строк. Он же и отображается методом dispayArr.

#### Замечание
На мой взгляд, я не смог достичь изящного, краткого решения. Лучще бы было использовать что-то на подобие "векторов" из С++, то есть можно было бы преобразовать размер исходного массива динамически в соответствии с задачей, удалив ненужные строки. Однако, я решил ничего не пробовать того, о чем в курсе речь не шла и постарался выполнить вот таким вот образом.

Спасибо за внимание.
